t=1790:10:1990;
p=[3.929,5.308,7.24,9.638,12.866,17.069,23.192,31.443,38.558,50.156,62.948,75.995,91.972,105.711,123.2,131.669,150.697,179.323,203.212,226.505,248.71];
t=t-1790;
x0=[150,0.15];
x=lsqcurvefit('function_D',x0,t,p);
p1=function_D(x,t);
plot(t+1790,p,'o',t+1790,p1,'-r*')
title('Logistic模型拟合图')
xlabel('年');
ylabel('人口数');
legend('实际数据','理论数据')
disp('年份    实际数据    理论数据');
for i = 1:length(t)
    fprintf('%d      %.3f      %.3f\n', t(i) + 1790, p(i), p1(i));
end
fprintf('Nm=%.4f\n',x(1))
fprintf('r0=%.4f\n',x(2))